# Напишите программу, которая для целого числа k (от 1 до 99)
# напечатает фразу «k рублей», учитывая при этом,
# что при некоторых значениях слово «рублей» заменяется на «рубль» или «рубля».
# Если введено значение вне интервала от 1 до 99, то вывести "ошибка".
# put your python code here
r = int(input())

if r < 1 or r > 99:
    print("ошибка")
else:
    s = r%10
    if (s == 1) and (r != 11):
        print(r, "рубль")
    elif (r < 5) and (r != 1) or (r > 21) and (s < 5) and (r != 20) and (r != 30) and (r != 40) and (r != 50) and (r != 60) and (r != 70) and (r != 80) and (r != 90):
        print(r, "рубля")
    elif (r > 4) and (s > 4) or (10 < r or r < 20) or (r == 10) or (r == 20) or (r == 30) or (r == 40) or (r == 50) or (r == 60) or (r == 70) or (r == 80) or (r == 90):
        print(r, "рублей")
